#1.Дана строка: 'abcdef'. Получите каждый второй символ этой строки: 'ace'
str1 = 'abcdef'
print (str1[::2])

#2.Дано некоторое число:12345. Выведите в консоль все его символы с конца.
num1 = 12345
str2 = str(num1)
print(str2[::-1])