#1Даны два слова. Проверьте, что последняя буква первого слова совпадает с первой буквой второго слова.

#2Дана некоторая строка. Найдите позицию третьего нуля в строке.

#3Даны числа, разделенные запятыми:'12,34,56' Найдите сумму этих чисел.

#4Дана дата в следующем формате: '2025-12-31'Преобразуйте эту дату в следующий словарь:

dict1 = {
	'year' : '2025',
	'month': '12',
	'day'  : '31',
}
#5 Дан словарь. Получите сет его значений: {1, 2, 3, 4}

dict2 = {
	'a': 1,
	'b': 2,
	'c': 3, 
	'd': 4,
}
