#1 Дана некоторая строка с буквами и цифрами. Получите список позиций всех цифр из этой строки.

#2 Дана некоторая строка: 'AbCdE' Смените регистр букв этой строки на противоположный. 
#В нашем случае должно получится следующее: 'aBcDe'

#3 Дан некоторый список с числами, например, вот такой: [1, 2, 3, 4, 5, 6] Слейте пары элементов вместе:[12, 34, 56]

#4 Дана некоторая строка со словами: 'aaa bbb ccc eee fff'
#Сделайте заглавным первый символ каждого второго слова в этой строке. В нашем случае должно получится следующее:
#'aaa Bbb ccc Eee fff'