#1 Дана строка. Сделайте заглавной последнюю букву каждого слова в этой строке.

str1 = 'Python is language for programmers. And snake too.'

#2 Дана строка. Проверьте, что эта строка состоит только из четных цифр.

str1 = '24868426'

#3 Даны две строки. Получите символы, которые есть и в одной, и в другой строке: '45'

txt1 = '12345'
txt2 = '45678'

#4 Дана некоторая строка: 'a bc def ghij'
#Переведите в верхний регистр все подстроки, в которых количество букв меньше или равно трем. 
#В нашем случае должно получится следующее: 'A BC DEF ghij'

str1 = 'a bc def ghij'
