#1 Дан текст со словами. Запишите в список все слова, начинающиеся на букву 'a'.
str1 = '''another day in a paradise. slut, all fucks annihilation'''

#2 Дан список с числами. Проверьте, что все элементы этого списка являются положительными числами.

lst1 = [1, -3, 8, -8, 0, 5, 49, -2]

#3 Даны два списка. Получите список их общих элементов: [4, 5]

lst1 = [1, 2, 3, 4, 5]
lst2 = [4, 5, 6, 7, 8]

#4 Дана некоторая переменная с числом. 
#Сделайте строку, содержащую столько нулей, сколько указано в переменной. В нашем случае получится такая строка: '00000'

num = 5;



