#1 Дан список с числами. Проверьте, что в нем есть число, содержащее в себе цифру 3.

#2 Дана следующая структура:
#Найдите сумму элементов этой структуры.
lst1 = [
    {
		1: (1, 2, 3),
		2: (1, 2, 3),
		3: (1, 2, 3)
	},
	{
		1: (1, 2, 3),
		2: (1, 2, 3),
		3: (1, 2, 3)
	},
	{
		1: (1, 2, 3),
		2: (1, 2, 3),
		3: (1, 2, 3)
	}
]


#3 Дан список:
#Сделайте из этого списка строку так, чтобы каждый элемент списка был на новой линии:

lst1 = [
	'text1',
	'text2',
	'text3',
	'text4',
	'text5'
]


'''
	text1
	text2
	text3
	text4
	text5
'''
