#1 Попросите пользователя ввести два числа целых числа через консоль. 
#Заполните список целыми числами от минимального введенного числа до максимального.

#2 Попросите пользователя ввести дату в формате год-месяц-день. 
#Определите день недели, соответствующий этой дате.

#3 Попросите пользователя ввести год. Определите, високосный этот год или нет.

#4 Напишите программу, которая сформирует следующую строку: '54321'

#5 Дан некоторый список, например, вот такой: [1, 2, 3, 4, 5, 6]
#Поменяйте местами пары элементов этого списка: [2, 1, 4, 3, 6, 5]