#1Сделайте функцию, которая параметром будет принимать список и удалять из него все дубли.

#2Сделайте функцию, которая параметром будет принимать список и удалять из него все дубли, которые встречаются больше трех раз.

#3Сделайте функцию, которая параметром будет принимать список и удалять из него одинаковые, рядом стоящие элементы.

#4Сделайте функцию, которая параметром будет принимать список с числами и возвращать максимальное и минимальное значение из этого списка в виде следующего словаря:
#{'max': 9, 'min': 1,}