#1Сделайте функцию, которая параметром будет принимать число и удалять из него нули.

#2Сделайте функцию, которая будет возвращать сколько дней прошло или осталось до заданной даты в году, 
#в зависимости от того, была уже эта дата или нет.

#3 Сделайте функцию, которая вернет список всех високосных годов за предыдущие сто лет.

#4 Сделайте функцию, которая параметром будет год и проверять, високосный он или нет.

#5Сделайте функцию, которая будет возвращать сколько дней осталось до конца текущего месяца.

#6Сделайте функцию, которая вернет предыдущий, текущий и следующий дни недели словом в виде следующего словаря:
#{'next': 'пн', 'curr': 'вс', 'prev': 'сб',}