#1Сделайте функцию, которая вернет текущий день недели словом.

#2Сделайте функцию, которая параметром будет получать дату, а возвращать день недели словом, соответствующий этой дате.

#3Сделайте функцию, которая параметром будет принимать секунды, а возвращать количество суток, соответствующих этим секундам.

#4Сделайте функцию, которая параметром будет принимать число и строку и обрезать эту строку до длины, заданной первым параметром.

#5Сделайте функцию, которая параметром будет получать дату, а возвращать знак зодиака, соответствующий этой дате.

#6Сделайте функцию, которая параметром будет принимать число, а возвращать сумму его делителей.